{
    "greenPartyObj": {
        "name": "Green Party",
        "colour": "green",
        "leader": "Elizabeth May", 
        "position": 1,
        "history": "The modern green movement started in Canada and around the world in the 1960s when the counter-culture movement launched the first mass rejection of consumer culture. Five decades later, the 60s values of peace, love and understanding have become the founding Green Party values of non-violence, social justice and ecological thinking.",
        "youthPolicy": "The Greens promise to eliminate all tuition fees by 2020, by starting off with nixing them for low income students",
        "marijuanaPolicy": "\r\nThe Greens promise to legalize marijuana completely and collect taxes on the industry.",
        "firstNationsPolicy": "Honour Canada’s fiduciary responsibility, treaty rights, and other rights of Aboriginal peoples, including their inherent rights of self-government;",
        "housingPolicy": "",
        "healthPolicy":"The Greens would introduce a national pharmacare plan, which the party says will save the government $11 billion by buying in bulk.",
        "environmentPolicy": "Elizabeth May would introduce a carbon fee on fossil fuels. The revenues from this would be returned to all Canadians 18 or older in the form of a carbon dividend. Greens advocate a 40-per-cent reduction in greenhouse gas emissions from 2005 levels by 2025 and commit to $500 million each year to the Green Climate fund. May would also embed the right to a healthy environment in Canada’s constitution",
        "privacyPolicy": "",
        "veteranPolicy":"The Green party promises to support the re-opening all closed Veterans Affairs offices, restore cut funding to Veterans Affairs, and provide service dogs to all veterans who require one.", 
        "pipelinePolicy": "The Green party oppose all pipeline projects currently proposed.",
        "prominentPolicies" : [ 
            {"name" : "Canada That Works Together", "description": "Our plan proposes democratic reforms that will make our politicians more accountable, our parliament more accessible, and our voting system more representative. Our plan takes bold climate action, by embracing the solutions that we already know work, encouraging research into those we have yet to discover, and increasing the taxes paid by corporate polluters."},
            {"name" : "Sustainable Economy", "description": "We need to immediately build those sectors that benefit from the lower Canadian dollar – manufacturing, tourism, value-added forest products and cultural industries. We need to resurrect federal engagement in tourism promotion and support. We need to embrace the 21st century economic revolution of clean technology. "},
            {"name" : "Strong Communities", "description": "Our nation needs a government that will invest in the fundamental building blocks on which our neighbourhoods rely – from healthcare to transit, child care to public parks, bridges to local agriculture. All with the aim of increasing the affordability and livability of the towns and cities we call home." }
        ],
        "prominentMembers" : [
            {"name" : "Bruce Hyer", "position" : "Deputy Leader", "image" : "bryce-hyer.jpg"},
            {"name" : "Daniel Green", "position" : "Deputy Leader", "image" : "daniel-green.jpg"}
        ]
        },

    "liberalPartyObj": {
        "name": "Liberal Party", 
        "colour": "Red", 
        "leader": "Justin Trudeau", 
        "position": 1,
        "history": "Liberal Party of Canada, French Parti Libéral du Canada, centrist Canadian political party, one of the major parties in the country since the establishment of the Dominion of Canada in 1867. The Liberal Party has been the governing party at the federal level for most of the period since the late 1890s, bringing together pragmatic social policy reformers and advocates of free enterprise, the balance between them shifting as leaders and context changed. The Liberal Party traditionally has been described as a “brokerage” party, in recognition of its success in appealing to a range of interests divided by region, language, ethnicity, and social class.",
        "youthPolicy": "The Liberals promise to form a Prime Minister’s Youth Advisory Council, consisting of Canadians aged 16-24, to bring young voices to Ottawa. They pledge to invest $1.3 billion over three years to create jobs for young people, including hiring more guides and interpreters for Parks Canada.",
        "marijuanaPolicy": "The Liberals would legalize marijuana completely and collect taxes on the industry.", 
        "firstNationsPolicy": "The Liberals support an inquiry into missing and murdered Aboriginal women. They have promised to implement all 94 recommendations of the Truth and Reconciliation Commission. Trudeau has also promised $2.6 billion for First Nations education over four years and an additional $500 million on infrastructure for First Nations schools. Trudeau has also promised to eliminate all boil-water advisories in First Nations communities.",
        "housingPolicy":"The Liberals pledge $20 billion for what they call “social infrastructure,” which would include $125 million per year in tax breaks for developers and landlords to encourage renovations in rental suites. They have also promised a review of foreign ownership in Canadian housing markets.",   
        "healthPolicy": "The Liberals propose $3 billion in funding over four years to improve the national health care system. This would focus on boosting home care, lower the cost of prescription drugs and improve mental health care. They would also work with the provinces to negotiate better prices on prescription drugs.",
        "environmentPolicy": "The Liberals promise a medicare-style approach to carbon pricing through which Ottawa would set national targets and enforces principles but allow provinces to design their own systems. Within three months of the UN Climate Change Summit in Paris, Justin Trudeau would meet with the premiers to develop a climate change strategy. The Liberals would also improve access to National Parks, waiving entry fees for new Canadians.",
        "privacyPolicy": "The Liberals would keep bill C-51, but make some amendments to the bill. It promises to institute a sunset clause on some parts of the bill",
        "veteransPolicy": "The Liberal party promises to reopen the closed Veterans Affairs offices and invest $300 million a year to reform veterans’ benefits.",
        "pipelinePolicy": "Enbridge Northern Gateway: The Liberals are against this project and would scrap it completely.\r\nTransCanada Keystone XL: Justin Trudeau is supportive of a Keystone XL pipeline.\r\nKinder Morgan Expansion: Historically Trudeau has supported the expansion of Kinder Morgan pipeline, but he neither confirmed nor denied whether he would reject or approve the expansion. In the past he has said that the project still needs to secure social license from communities and prove it can protect the environment. However, Trudeau\"s promise to formalize the moratorium on crude oil tanker traffic on British Columbia\"s North Coast would mean that he would block development of Kinder Morgan.\r\n",

        "prominentPolicies" : [ 
            {"name" : "Helping Families", "description": "We will give families more money to help with the high cost of raising their kids. We will cancel tax breaks and benefits for the wealthy – including the Universal Child Care Benefit – and introduce a new Canada Child Benefit to give Canadian"},
            {"name" : "Middle Class Tax Cut", "description": "We will cut the middle income tax bracket to 20.5 percent from 22 percent – a seven percent reduction. Canadians with taxable annual income between $44,700 and $89,401 will see their income tax rate fall. This tax relief is worth up to $670 per person, per year – or $1,340 for a twoincome  household"},
            {"name" : "Opportunities for Young Canadians", "description": "We will invest to create more jobs and better opportunities for young Canadians. We will invest $40 million each year to help employers create more co-op placements for students in science, technology, engineering, mathematics, and business programs." }
        ],
        
        "prominentMembers" : [
            {"name" : "Omar Alghaba", "position" : "Parliamentary Secretary to Minister of Foreign Affairs", "image" : "peter-mackay.jpg"},
            {"name" : "Arnold Chan", "position" : "Member of House of Commons", "image" : "arnold-chan.jpg"},
            {"name" : "Alain Rayes", "position" : "Quebec Political LIeutenant", "image" : "alain-rayes.jpg"},
            {"name" : "Scott Brison", "position" : "President of the Treasury Board", "image" : "scott-brison.jpg"}
        ]
    },


    "ndpPartyObj" : {
        "name": "New Democratic Party",
        "colour": "Orange",
        "leader": "Tom Mulcair",
        "position": 1, 
        "history": "The New Democratic Party (NDP) was founded in Ottawa in 1961 by Tommy Douglas  at a convention uniting the Co-Operative Commonwealth Federation(CCF) and affiliated unions of the Canadian Labour Congress (CLC) and also New Party clubs. A social democratic party, the NDP has formed the government in several provinces but never nationally. In 2011, it enjoyed an historic electoral breakthrough, becoming the official opposition in Parliament for the first time.",
        "youthPolicy": "The NDP promise to commit $100 million to improve mental health services for youth. An additional $200 million over four years would go towards helping youth find employment, including “cracking down” on unpaid internships and creating co-op or paid internship opportunities.",
        "marijuanaPolicy": "The NDP promise to decriminalize marijuana, and then enter into public discussions about what should happen thereafter.",
        "firstNationsPolicy": "The NDP would launch an inquiry into missing and murdered Aboriginal women. It promises $4.8 billion over eight years to invest in First Nations education, and $375 million over four years to critical infrastructure in indigenous communities, like water sanitation. It has also promised $68 million over four years to revive First Nations languages, by establishing a National Indigenous Languages Revitalization Fund and a National Indigenous Languages Institute.",
        "housingPolicy": "The NDP promise an investment of $500 million in the construction of affordable housing, and would introduce an act that made the right to affordable housing a fundamental right.",
        "healthPolicy": "The NDP promise 1.8 billion over 4 years to ensure universal access to prescription medication for Canadians. They would also spend 40 million over four years to develop a nationwide alzheimer\"s and dementia strategy. Lastly, the NDP would earmark 500 million to expand health care clinics and hire new health care providers.", 
        "environmentPolicy": "The NDP intend to redirect about a billion dollars from fossil fuel subsidies to investment in clean technology. They favour a country-wide cap-and-trade program to lower greenhouse gas emissions. An NDP government would also bring back the Home Retrofit Program, which funds home energy renovations. This program was introduced then shut down by the Conservatives.",
        "privacyPolicy": "The NDP promises to scrap bill C-51 completely. The party voted against the bill when it was first proposed by the Conservatives.",
        "veteranPolicy": "The NDP promises to reopen the closed Veterans Affairs offices and invest $454 million over four years to provide better treatment for veterans with post-traumatic stress and mental health problems, enhance long-term care programs, and increase survivors’ pensions.",
        "pipelinePolicy": "The NDP are against Enbridge Northern Gateway and Keystone XL, but tentatively open to a west-east pipeline if a better environmental review process was set up.\r\nKinder Morgan Expansion: NDPs are divided on the project - MPs from Vancouver and Burnaby do not support the project but Rachel Notley of Alberta does. Thomas Mulcair favours an overhauling of the pipeline approval process. He says he\"ll support Kinder Morgan so long as it passes an environmental review.\r\nEnergy East: Mulcair says that if the pipeline is proved to be incompatible with national action on climate change, the NDP would reject the project.\r\n",

        "prominentPolicies" : [ 
            {"name" : "Improve Health Care", "description": "We will immediately inform Canada’s premiers that Harper’s unilateral health cuts have been cancelled and begin work to develop a new  health accord that will reduce waits for family doctors, create 5,000 new long-term care beds and lower prescription drug costs by 30%."},
            {"name" : "Step Up to Fight Climate Change", "description": "I will personally lead the Canadian delegation to the COP21 climate conference in Paris with firm targets to cut pollution, and bring in a home retrofit program to lower your household heating costs."},
            {"name" : "Make Life More Affordable", "description": "We will take the first step towards our goal of universal, affordable childcare by immediately flowing funding for over 60,000 childcare spaces at no more than $15 a day. We will restore the age of retirement to 65, and introduce a new Consumer Protection Act to cap ATM fees and ensure Canadians have access to a low-interest credit card." }
        ],
        "prominentMembers" : [
            {"name" : "Charlie Angus", "position" : "Member of House of Commons", "image" : "charlie-angus.jpg"},
            {"name" : "Rachel Blaney", "position" : "Seniors, Infrastructure and Communities", "image" : "rachel-blaney.jpg"},
            {"name" : "Marjolain Boutin-Sweet", "position" : "Whip, Housing", "image" : "marjolaine-boutin-sweet.jpg"},
            {"name" : "Daniel Blaikie", "position" : "National Caucus Chair", "image" : "daniel-blaikie.jpg"}
        ]   

    },

    "conservativePartyObj" : {
        "name": "Conservative Party",
        "colour": "Blue",
        "leader": "Andrew Sheere",
        "position": 1, 
        "history": "The Conservative Party of Canada (French: Parti conservateur du Canada), colloquially known as the Tories, is a political party in Canada. It is positioned on the right of the Canadian political spectrum.[8] The party\"s leader from 2004 to 2015 was Stephen Harper, who served as Prime Minister from 2006 to 2015.\r\nOn October 16th, 2003, the leaders of the Canadian Reform Conservative Alliance and the Progressive Conservative Party of Canada announced an agreement-in-principle to unite under a new political banner.  In December 2003, the merger was overwhelmingly ratified by members of both parties and the Conservative Party of Canada was officially born.  This unification of Canada’s conservative parties restored and rejuvenated the national political movement that has been building a stronger, safer, and better Canada for almost 150 years.\r\n",
        "youthPolicy": "The Conservatives’ Economic Action Plan 2015 proposes to reallocate $7 million over two years, starting in 2015–16, to support the relocation of youth and immigrants to areas where job opportunities exist. Since 2006 the Conservative government has invested $330 million per year in the Youth Employment Strategy, but $97.1 million of that funding lapsed.",
        "marijuanaPolicy": "Opposed to legalization or decriminalization. Laws around medical marijuana have also changed, requiring users to order it from a licensed provider rather than being able to grow it themselves",
        "firstNationsPolicy": "The Conservatives are against an inquiry into missing and murdered Aboriginal women. They have promised to review the recommendations made by the Truth and Reconciliation Commission.", 
        "housingPolicy": "Conservatives promise to increase home ownership in Canada by 700,000. Stephen Harper promises to collect data on foreign investment in Canadian housing markets, and take steps to address the issue if necessary. They will also bring back a Home Renovation Tax credit.",
        "healthPolicy": "The Conservatives chose not to renew the 10 year, 41 billion dollar Canada Health Accord that expired in 2014. It was a deal between Ottawa and the provinces and territories on funding for healthcare, common wait times, home care and prescription drugs. Jim Flaherty proposed an extension that would increase funding based on economic growth, to come into force in 2017. In 2014, the Conservatives announced $31.5 million in funding for a plan on dementia.",
        "environmentPolicy": "From 2004 to 2008, the Conservative government was open to the idea of a cap-and-trade system for carbon pricing, and in 2008 John Baird announced the government promised to help develop and implement a North America-wide system which Stephen Harper reiterated. But in 2011 the Conservatives turned against the idea. Harper is now opposed to either a carbon tax or a cap-and-trade program. The Conservatives have contributed $300 million to the UN Green Climate Fund, that helps developing countries battle the effects of climate change. They have set emissions reduction targets under the Copenhagen Accord, but unless further climate legislation is brought in, Canada is on track to miss those targets in 2020.",
        "privacyPolicy": "The Conservatives would keep bill C-51, which they introduced to give law enforcement more power to investigate those suspected of terrorism and stop speech that glorifies or promotes terrorism.",
        "veteranPolicy": "The Conservative party promises to improve the earnings loss benefit for veterans with service-related injuries by letting them earn up to $10,000 in outside work without losing any government funding. Veterans Affairs Canada allowed $1.13 billion in funding to lapse since 2006, and by the end of 2014, the federal government had closed nine Veterans Affairs offices in seven provinces as a cost-saving measure.",
        "pipelinePolicy": "Enbridge Northern Gateway, Keystone XL, Kinder Morgan Expansion, Energy East are all approved and supported by the Conservative government.",

        "prominentPolicies" : [ 
            {"name" : "Balanced Budget", "description": "A balanced budget is the anchor of our low-tax plan to protect our fragile economy and help Canadian families. We’ll continue to make the right choices to keep our budget balanced and taxes low."},
            {"name" : "Lower Taxes", "description": "Our low-tax pledge is rooted in our record: Canadians know that we’ll do what we say and that we’ll manage taxpayer dollars responsibly. We’re prepared to go even further and entrench our low-tax plan in legislation. Our ''tax lock'' legislation will back our low-tax commitment – to families, seniors, workers and small businesses – with the force of  the law for the next four years. "},
            {"name" : "Family Home", "description": "Homeownership is a key way to support Canadian families. And we’re helping more Canadians become homeowners byproviding new support to buy and invest in their homes. Nowone in seven Canadian households owns their own homes –one of the highest rates in the industrialized world. And, underour plan for affordable, responsible homeownership, we'll aimto add more than 700,000 new homeowners by 2020" }
        ] ,  
        "prominentMembers" : [
            {"name" : "Mark Strahl", "position" : "Deputy Leader", "image" : "mark-strahl.jpg"},
            {"name" : "Lisa Raitt", "position" : "Deputy Leader", "image" : "lisa-raitt.jpg"},
            {"name" : "Alain Rayes", "position" : "Quebec Political Lieutenant", "image" : "alain-rayes.jpg"},
            {"name" : "Candice Bergen", "position" : "House Leader of the Official Opposition", "image" : "candice-bergen.jpg"}
        ]
    }
}
